{
  "executive_summary": "<p>Actuals are presented through the last completed month, December 2025; all figures from January 2026 onward are forecast. December actuals confirm strong top-line progress with ARR of £21.1m and 20% growth, supported by a resilient 78% gross margin and disciplined operating spend. Efficiency is improving (CAC ratio 0.62, LTV:CAC 8.0), and EBIT has turned decisively positive in the forecast from Q2 2026 as operating leverage builds. Retention remains the primary headwind versus benchmark (logo 87%, gross 85%, net 95%), driven by concentrated churn in Finance & Professional Services and Africa during the last quarter; however, new and expansion activity in Energy & Utilities, North America, and Life Science offset a significant portion of that pressure. The forecast assumes stabilization of retention at or above recent actuals and continued mix shift to higher-expansion verticals, which underpins margin expansion and a rising Rule of 40.</p>",
  "page1": "<p>Scale and growth. ARR stands at £21.1m with 20% growth versus a 19% benchmark. Customer count is 195 and average ARR per customer is £108k, consistent with enterprise mix. Headcount is 121 and ARR per head is 174, more than double the 77 benchmark, indicating strong productivity.</p><p>Revenue quality. Gross margin is 78% (vs 72% benchmark) and recurring margin 80% (vs 77%), with 96% of revenue recurring (vs 90%). Non-recurring margin at 27% suggests implementation and services remain healthy contributors without diluting overall margin.</p><p>Profitability and spend mix. S&M is 21% of revenue (vs 32% benchmark) and Development is 28% (vs 33%); G&A is 17% (vs 22%). EBIT margin is 12% vs a negative benchmark, reflecting operating leverage already visible in the actuals and carried into the forecast.</p><p>Efficiency. CAC ratio is 0.62 and LTV:CAC is 8.0, both supportive of sustained growth investment. Rule of 40 is 32% vs 15% benchmark; as retention improves and growth compounds, we expect this to rise.</p><p>Retention. Logo retention is 87% and gross retention 85% versus 91% benchmarks, with net retention at 95% versus a 101% benchmark. As detailed on pages 4–5, churn in Finance & Professional Services and Africa drove the recent shortfall; mitigation is underway via mix shift and upsell focus in Energy & Utilities and Life Science.</p>",
  "page2": "<p>Logos and ARR movement. Over the timeline to December 2025, logos increase from 68 to 96 with steady quarterly new wins and limited losses. ARR retained in December 2025 is 8,696, with gross retention of 95% and net of 98%, reflecting the quarter’s churn headwinds partly offset by expansion. Land in the period is 720, and ARR net in December is 506, consistent with the last-three-months detail on page 5.</p><p>Growth profile and retention. Quarterly growth steps down mid-year and then re-accelerates in calendar 2026 forecasts (e.g., growth of 10% in March 2026 rising through the year), driven by higher land and expansion. Logo retention remains high through most periods, with dips to 95–96% in late 2025 aligning to the churn items called out on page 5.</p><p>Outlook. The forecast assumes net retention at or above 100% in several 2026 quarters and a gradual rise in land, consistent with the pipeline shift toward higher-expansion verticals observed on page 4.</p>",
  "page3": "<p>P&L actuals to December 2025. Revenue reaches 8,379 in December 2025 with a stable 78% gross margin. Operating costs are 7,171, yielding EBIT of -595 in December; the improvement from -1,221 in March 2025 reflects S&M leverage (S&M % down from 46% to 37%), stable R&D at 28–29%, and disciplined G&A at ~20%.</p><p>Turn to profitability in forecast. EBIT turns positive by June 2026 (207) and reaches 891 by December 2027, with EBIT margin improving from -7% in December 2025 to 6% by December 2027. The path is driven by revenue growth to 15,823 by December 2027, while S&M % declines to 26% and G&A to 19%, preserving R&D at 28% to support product velocity.</p><p>Efficiency metrics. CAC ratio trends from ~0.65 to 0.53 by December 2027; LTV:CAC rises to 9.7. Rule of 40 moderates to mid-30s during the 2026 investment period and rebuilds to 47% by December 2027 as growth and margins compound.</p><p>Headcount. Total headcount rises from 53 in March 2025 to 64 in December 2025 actuals and to 106 by December 2027, with most additions in Development and Go-To-Market. Revenue growth outpaces headcount growth, consistent with the ARR per head improvement noted on page 1.</p>",
  "page4": "<p>ARR mix by vertical at December 2025 totals 9,416. Energy & Utilities is the largest at 3,949 with 128% growth and 98% net retention, indicating strong expansion and durability. Life Science is 2,498 with 66% growth and 106% net retention, another engine for upsell. Government is 1,305 with 21% growth and 96% net retention. Finance & Professional Services is 900 with 11% growth and 44% net retention, highlighting concentrated churn risk seen again on page 5. 3rd Sector and Education is 765 with 70% growth and 78% net retention.</p><p>ARR by country totals 9,416. South America 2,183 and Asia 2,093 lead the growth cohorts (80% and 50% growth respectively). Europe grows 117% off a smaller base to 1,418. North America and Africa are similar in scale (1,868 and 1,856) with high-80s to mid-90s net retention; Africa shows elevated churn in the last quarter as detailed on page 5.</p><p>Cohort dynamics. Across the last 12 months, retained ARR is 5,006 with land of 4,410 and expansion of 619, offset by downsell of -270 and lost of -878. The 12‑month NRR tracks near 90%, with a slight uptick into year-end as Energy & Utilities and Life Science expansions accelerate.</p><p>Customer concentration. The customer-by-month table highlights repeated expansion in several Energy & Utilities and Life Science accounts through the year, while Finance & Professional Services shows isolated red cells indicating downsell/loss events, consistent with the net retention gap in that vertical.</p>",
  "page5": "<p>Last three months actuals (Oct–Dec 2025). Net ARR added is 506, comprised of 720 from new logos, 236 from expansion, -45 from downsell, and -405 from lost. The mix skews toward new business, with expansion strongest in Energy & Utilities and Life Science.</p><p>By vertical. Energy & Utilities contributes the largest net at 461, Government 135, Life Science 180, and 3rd Sector and Education 90. Finance & Professional Services is -360 net over the period, reflecting a handful of meaningful churn events; these are the primary driver of the logo and gross retention shortfalls on page 1 and the lower net retention for that vertical on page 4.</p><p>By country. North America delivers 315 net and South America 135; Asia is 90 net. Africa is -34 net, with the period including a -405 lost event partially offset by new and expansion, visible in the customer list. This explains the country retention pressure called out on page 4 despite healthy growth in other regions.</p><p>Customer highlights. Positive: multiple £90–£101 expansions and new lands in Energy & Utilities across North America, Asia, South America, and Africa; Life Science adds several £90 new deals in North America. Negative: two notable Finance & Professional Services churn items in Africa (-135 and -90) and an additional -90 in South America, plus a -405 loss in Africa.</p><p>Implications. The quarter demonstrates strong new logo velocity and targeted expansion in our highest-NRR verticals, which supports the forecasted re-acceleration in 2026. The concentration of churn in Finance & Professional Services and Africa warrants focused action on renewals, customer success coverage, and pricing/packaging in that segment; mitigating this concentration is the quickest path to lifting logo, gross, and net retention toward benchmark.</p>"
}