{
  "executiveSummary": "<p>Results are actuals through the last completed whole month in real time, which is December 2025. Periods from March 2026 onward are forecast. The business closed December with <b>£9.4m ARR</b>, 96 customers, and gross margin at 78%. Rule of 40 is 63% and EBIT margin is -7% in the last actual quarter, improving to positive from March 2026 in the plan. Growth is healthy and efficient (ARR growth 70% with CAC ratio 0.56 and LTV:CAC 6.5), but retention remains the primary headwind (gross 79%, net 90% on page 1; rolling 12‑month NRR ~90% on page 4). The last three months of actuals (page 5) added <b>£506k net ARR</b>, driven by 8 new logos and £236k expansion, partially offset by £405k churn and £45k downsell. Churn was concentrated in Finance & Professional Services and in Africa, while net adds were strongest in Energy & Utilities and North America. The forecast assumes retention normalization (gross mid‑90s, net ~100%) and continued mix shift toward higher‑performing verticals and regions, alongside operating leverage from S&M.</p><p>Key focus areas for the next quarter: lift retention toward the low‑to‑mid 90s gross and ~100% net, maintain disciplined S&M efficiency while scaling new logo volume, and sustain gross margin at or above 78% as COGS scales.</p>",
  "page1": "<p>Overall metrics show scale and efficiency improving, with retention the principal gap to benchmark.</p><ul><li>Scale and growth: ARR is <b>£9.4m</b> with 96 customers and average ARR of £98k. ARR growth is 70% versus a 19% benchmark, supported by a steady upward trend.</li><li>Margins: Gross margin <b>78%</b> and recurring margin <b>83%</b> both sit above the benchmarks (72% and 77%). Non‑recurring margin is low at 4% by design, with revenue mix heavily recurring (94%).</li><li>Efficiency: Rule of 40 at <b>63%</b>, CAC ratio <b>0.56</b>, and LTV:CAC <b>6.5</b> indicate strong go‑to‑market efficiency. ARR per head is 147k versus a 77k benchmark.</li><li>Spend mix: S&M is 37% of revenue (above the 32% benchmark), while Development is 28% (below a 33% benchmark) and G&A is 20% (better than a 22% benchmark). This reflects a deliberate bias toward growth while maintaining operating discipline.</li><li>Profitability: EBIT margin is -7% (slightly below a -6% benchmark). The trajectory in page 3 points to a near‑term inflection to positive EBIT as revenue scales and S&M percent tapers.</li><li>Retention: Logo retention 85%, gross retention 79%, net retention 90% are below benchmarks (91%, 91%, 101%). This aligns with the rolling NRR trend on page 4 and the churn details on page 5.</li></ul><p>Takeaway: Commercial efficiency is strong and scale is building quickly; the limiting factor to faster net growth is retention, which is being addressed in the plan.</p>",
  "page2": "<p>Logos, ARR and deals show a consistent build in ARR with healthy new logo flow, moderated by churn in the latest quarter.</p><ul><li>Logos: Ending logos rise from 68 (Mar 2025) to 96 (Dec 2025 actual) and are forecast to 168 by Dec 2027. New logos per quarter are 8–16 in the plan, consistent with page 5 activity in the last three months.</li><li>ARR progression: ARR steps from <b>£6.84m (Mar 2025)</b> to <b>£9.42m (Dec 2025 actual)</b>, and is forecast to <b>£17.65m (Dec 2027)</b>. The Dec 2025 quarter ARR Net of <b>£506k</b> reconciles to page 5.</li><li>Expansion/downgrade/churn: Dec 2025 quarter shows expansion £236k, downsell -£45k, attrition -£405k. That mix explains the sub‑benchmark gross and net retention on page 1.</li><li>Retention metrics: Logo retention is 96% for Dec 2025 quarter, gross 95% and net 98% in the table, but the rolling 12‑month view on page 4 averages lower (~90% NRR) due to earlier periods. The forecast assumes an improvement back toward high‑90s.</li><li>Land motion: Quarterly land ARR is £720k in Dec 2025, consistent with the 8 new logos shown in page 5, underpinning the growth outlook.</li></ul><p>Implication: New logo and expansion engines are healthy; delivering the forecast depends on holding churn to planned levels and continuing the current pace of landing deals.</p>",
  "page3": "<p>P&amp;L and headcount show gross margin resilience, operating leverage in S&amp;M, and a path to positive EBIT from March 2026.</p><ul><li>Revenue and margin: Revenue grows to <b>£8.38m (Dec 2025)</b> with gross margin steady at <b>78%</b>. Recurring revenue dominates, aligned with page 1’s 94% recurring mix.</li><li>Operating costs: Operating expenses of <b>£7.17m (Dec 2025)</b> reflect S&amp;M at 37% of revenue, Development ~28%, and G&amp;A ~20%. The plan drives S&amp;M to 26% by Dec 2027 while holding R&amp;D and G&amp;A roughly flat as a percent, creating leverage.</li><li>EBIT trajectory: EBIT improves from <b>-£595k (Dec 2025)</b> to positive in <b>Mar 2026 (£207k)</b>, and to <b>£891k (6% margin) by Dec 2027</b>. This is consistent with page 1’s Rule of 40 and efficiency metrics.</li><li>Go‑to‑market efficiency: CAC ratio trends around 0.60–0.65; LTV:CAC remains high (6–9x across the horizon), supporting continued investment in new logos as long as retention improves.</li><li>Headcount: Total headcount rises from 64 (Dec 2025) to 106 (Dec 2027), with most additions in Development (29 to 53) and COGS (10 to 18) to support product depth and delivery quality. S&amp;M grows modestly (21 to 26), reinforcing the efficiency thesis.</li></ul><p>Risks and levers: The profitability path depends on maintaining gross margin at ~78%, achieving the planned S&amp;M mix shift, and lifting retention (pages 1, 4, 5). Any slippage in churn would delay EBIT breakeven by one to two quarters.</p>",
  "page4": "<p>ARR by vertical and country highlights concentration in Energy &amp; Utilities and Life Science, with rolling NRR softness now stabilizing.</p><ul><li>Vertical mix: Energy &amp; Utilities is the largest at <b>£3.95m</b>, followed by Life Science <b>£2.50m</b>, Government <b>£1.31m</b>, Finance &amp; Professional Services <b>£0.90m</b>, and 3rd Sector &amp; Education <b>£0.77m</b>. Expansion has been strongest in Energy &amp; Utilities and Life Science.</li><li>Country mix: South America <b>£2.18m</b>, Asia <b>£2.09m</b>, North America <b>£1.87m</b>, Africa <b>£1.86m</b>, Europe <b>£1.42m</b>. Recent net adds skew to North America and South America, matching page 5.</li><li>Retention: Rolling 12‑month NRR trended from 114% in early 2025 down to ~90% by Q4, with a slight uptick in December. Gross retention is ~90% overall, with stronger performance in Energy &amp; Utilities and weaker in Finance &amp; Professional Services. This aligns with the churn events shown on page 5.</li><li>ARR bridge: The latest 12‑month bridge shows retained ARR of ~£5.0m from a £5.5m start, with expansion £0.62m, downsell -£0.27m, and lost -£0.88m, landing at <b>£9.42m</b> after new land. The pattern underscores why improving save rates in Finance &amp; Professional Services is high leverage.</li><li>Customer panel: The monthly customer grid evidences concentrated events (several £90–£203k movements). The cadence of positive adds is broad‑based, but the red cells around Finance &amp; Professional Services churn are visible and match page 5 detail.</li></ul><p>Actions: Prioritize retention plays in Finance &amp; Professional Services and African accounts, replicate the Energy &amp; Utilities playbook in North America, and continue targeted expansion in Life Science where net expansion is consistently positive.</p>",
  "page5": "<p>Last three months actuals (Oct–Dec 2025) by vertical, country and customer.</p><ul><li>Net ARR: <b>+£506k</b> = New £720k + Expand £236k − Downsell £45k − Lost £405k.</li><li>Logos: 8 new logos, 4 lost, net +4. Deal sizes are clustered at ~£90–£135k per logo, with one ~£203k land.</li><li>By vertical: Energy &amp; Utilities <b>+£461k</b>, Life Science <b>+£180k</b>, Government <b>+£135k</b>, 3rd Sector &amp; Education <b>+£90k</b>, Finance &amp; Professional Services <b>-£360k</b>. The negative in Finance &amp; Professional Services explains the lower gross/net retention on pages 1 and 4.</li><li>By country: North America <b>+£315k</b>, South America <b>+£135k</b>, Asia <b>+£90k</b>, Europe ~£0k, Africa <b>-£34k</b>. This mix matches the country ARR panel on page 4.</li><li>Customer concentration: Gains are diversified across multiple £90k lands and expansions in Energy &amp; Utilities and Life Science. Churn is concentrated in Finance &amp; Professional Services (including two larger losses totaling ~£225k) and a smaller loss in Energy &amp; Utilities (~£45k). The single largest positive item is a ~£203k new logo.</li><li>Interpretation: The engine is landing well and expanding, but specific segments (Finance &amp; Professional Services, selected African accounts) are pulling down NRR. Addressing that cohort would have moved the quarter’s NRR above 100%.</li></ul><p>Near‑term actions: targeted save programs in Finance &amp; Professional Services, review of pricing/packaging where downsell occurred, and continued emphasis on North America and Energy &amp; Utilities plays that are consistently producing £90k–£203k deal sizes with strong early expansion.</p>"
}