{
  "page1": "<p>ARR stands at £9.8m across 161 customers with an average of £61k per logo. Efficiency remains a strength: recurring revenue is 96% of total, gross margin is 78%, recurring margin 80%, and EBIT is positive at 4%. CAC ratio of 0.59 and LTV:CAC of 10.1 indicate strong unit economics and room to invest.</p><p>Growth is robust at 42% versus a 19% benchmark, and ARR per head is 163k with a team of 60, well ahead of the benchmark. Operating discipline is evident: Sales & Marketing at 27% and General at 19% are both below benchmarks, while Development is at 28%.</p><p>Retention is the area to watch. Logo retention is 91% (in line with benchmark), but gross retention is 87% versus a 91% benchmark. Net retention is 101% today, but page 2 shows it has dipped to 94% in recent quarters, so the current figure may reflect a short, favorable window. Addressing churn and downsell is the main lever to protect growth quality.</p><p>Rule of 40 shows a mixed picture. The summary view shows 46%, while the detailed P&L view (page 3) totals closer to the mid-30s using the latest growth plus EBIT% (c. 25% + 9% ≈ 34%). We should align methodology across dashboards; directionally, growth is strong but decelerating, so maintaining profitability while re-accelerating ARR is the priority.</p><ul><li>Near-term focus: stem gross retention pressure, sustain expansion, and selectively increase go-to-market investment given our low CAC and strong LTV.</li><li>Confirm Rule of 40 and LTV:CAC calculation windows to ensure consistent board-level tracking.</li></ul>",
  "page2": "<p>Logos increased from 95 to 182 over the period, with 55 new logos in the most recent quarter; however, lost logos have trended up to 17. ARR continues to grow, reaching £10.9m, but growth is decelerating: ARR net additions fell from ~£2.9m in Dec 27 to ~£2.2m in Jun 28, and growth % eased from low-40s to 25%.</p><p>Retention drivers explain the deceleration. Recent gross retention is 83% and net retention 94%, both below the page 1 snapshot of 87%/101%. Expansion was £919k this quarter versus rising downsell (£531k) and higher attrition (£938k). Land ARR at £2.75m remains healthy, but more of the new ARR is required just to offset churn.</p><ul><li>Pipeline mix: emphasize multi-product and higher-ARPU lands to raise expansion potential; use pricing and packaging to mitigate downsell risk.</li><li>Churn containment: targeted save motions for cohorts with rising attrition; pair CS interventions with clear renewal playbooks and value realization milestones by month 3 and month 6.</li><li>Given CAC ratio of ~0.6 and strong LTV (see pages 1 and 3), there is headroom to add capacity to demand generation and account expansion without compromising payback.</li><li>Set a near-term goal to lift gross retention back toward 89–90% and NRR back over 100%, which should restore ARR net adds to >£2.5m per quarter.</li></ul>",
  "page3": "<p>Revenue rose from £5.1m to £10.1m with gross margin steady at 78%. Operating leverage is visible across functions: Sales & Marketing declined from 31% to 24–25% of revenue, General from 19% to 16%, and Development held at 28%. EBIT improved from negative to £943k (9%).</p><p>Efficiency metrics corroborate the headline page: CAC ratio is ~0.61 and LTV:CAC on this view is ~7.1 versus 10.1 on page 1. The variance likely reflects different time windows and churn assumptions; we should standardize definitions (e.g., use trailing 12 months for CAC and a consistent gross margin and churn basis for LTV).</p><p>Headcount scaled from 37 to 64. Notably, Sales & Marketing headcount has been flat at 16 for four quarters while revenue kept growing, which helps explain the improving CAC and EBIT, but may also be contributing to softer top-of-funnel momentum and slowing ARR growth (page 2). Development headcount grew to 33, supporting product delivery but increasing the need to monetize features via expansion.</p><ul><li>Target Rule of 40 back above 40% (currently mid-30s by this page’s math) by lifting growth while holding EBIT near high single digits.</li><li>Plan measured S&M hiring and demand programs where payback stays within our threshold; protect gross margin by maintaining the current services/revenue mix.</li><li>Tie new product releases to structured pricing and upsell motions to convert Development spend into expansion ARR.</li></ul>",
  "page4": "<p>Concentration by vertical shows Energy & Utilities at ~£2.0m ARR, followed by Government (~£1.2m), 3rd Sector & Education (~£0.9m), and Finance & Professional Services (~£0.75m). By region, Asia is the largest at ~£2.0m, then Africa (~£1.1m), Europe (~£1.1m), and North America (~£1.0m). Land contributions are strongest in Asia (c. £650k) and healthy across Europe and North America, suggesting continued opportunity to scale in those geographies.</p><p>Gross and net retention vary meaningfully by segment. Finance & Professional Services shows the lowest gross retention (~66%) and net (~71%), with Life Sciences also weaker (gross ~71%, net ~79%). These segments likely drive the overall gross retention drag seen on pages 1 and 2. Europe’s ARR net growth is strongest (~72%) with balanced land/expand; North America is mid-pack (~46%) with lower gross retention, indicating room for CS uplift.</p><p>The 12‑month NRR line trends from ~106% to ~88% through Dec 25, consistent with the retention pressure noted elsewhere. More recent quarters (page 2) show NRR stabilizing around 94% and the summary snapshot shows 101%, implying recent improvements that have not yet rolled through the full 12‑month window.</p><p>The customer heatmap highlights concentrated expansions (green 113s) around Jul–Sep and again Feb–Apr, alongside a handful of reductions. This seasonality should inform renewal and expansion campaigns, with proactive value reviews 90 days before those clusters.</p><ul><li>Focus CS and product enablement on Finance & Professional Services and Life Sciences to raise gross retention by 3–5 pts; deploy segment-specific ROI proof points.</li><li>Double down in Europe and Asia where land and expand velocity are strongest; in North America, prioritize save plays and structured upsell bundles.</li><li>Introduce cohort pricing adjustments and success plans timed to renewal seasonality seen in the heatmap to convert more accounts to the higher tier (113 level) and prevent mid-contract downsells.</li></ul>"
}