{
  "executive_summary": "<p>We are scaling efficiently with ARR at £21.1m and ARR growth of 20% while maintaining a 78% gross margin and delivering a 12% EBIT margin. Efficiency continues to strengthen: S&M spend is 21% of revenue, CAC ratio is 0.62, LTV:CAC is 8.0, and ARR per head is 174k. While overall momentum is strong and ahead of the displayed benchmarks on most unit economics, retention remains the primary headwind: logo retention at 87%, gross retention at 85%, and NRR at 95% are below the benchmarks shown. Headcount has grown to 121 with operating leverage evident in declining cost ratios and rising EBIT. The mix is highly recurring (96%), with non‑recurring contributing modestly at a lower margin. The growth engine is balanced between new logo land (£4.41m in the latest period) and expansion (£1.66m) but is offset by attrition of £2.16m and downsell of £0.45m. Concentration by vertical and region is visible on the cohort page (Energy & Utilities and South America lead), which warrants monitoring as we scale. The immediate opportunity is to reinvest a portion of our efficiency gains into retention and targeted expansion to move NRR above 100% while preserving margin progress.</p>",
  "page1": "<p>Overall metrics indicate healthy, profitable growth with improving efficiency. ARR is £21.1m with 20% growth versus a 19% benchmark. Gross margin holds at 78% (vs 72% benchmark) driven by an 80% recurring margin and only 4% of revenue from non‑recurring work. The Rule of 40 is 32%: solid versus the 15% benchmark but still shy of best‑in‑class 40%+; the trend suggests continued improvement as efficiency gains persist.</p><p>Go‑to‑market efficiency is a strength: S&M is 21% of revenue (well below the 32% benchmark), CAC ratio is 0.62 (vs 1.20), and LTV:CAC is 8.0. This combination supports selective reinvestment without materially pressuring margins. Average ARR per customer is £108k across 195 customers, indicating an enterprise‑leaning mix; ARR per head of 174k (vs 77k benchmark) reflects solid productivity.</p><p>The principal drag is retention: logo retention at 87% and gross retention at 85% trail the 91% benchmark, with net retention at 95% (vs 101% benchmark). Expansion is strong enough to offset most churn, but we are leaving growth on the table. Focused actions on onboarding, adoption, and multi‑product penetration should move NRR above 100%.</p><p>Operating cost mix shows discipline: Development at 28% (vs 33% benchmark) and General at 17% (vs 22% benchmark) alongside the lower S&M spend underpin an EBIT margin of 12% (vs a negative benchmark). This creates room to address retention and targeted growth while sustaining profitability.</p>",
  "page2": "<p>Logos and ARR dynamics for the latest period (Dec 28) show balanced growth. We added 49 new logos and lost 22, ending with 195 total. Starting ARR was £17.65m; we delivered £1.66m of expansion and £4.41m of new‑logo land, offset by £0.45m of downsell and £2.16m of attrition, to reach £21.11m ARR.</p><ul><li>Growth: 20% growth is underpinned by both land and expand. Deals total £6.78m, indicating healthy pipeline throughput.</li><li>Retention: logo retention 87%, gross retention 85%, and NRR 95%. Expansion is strong but not yet enough to overcome churn/downgrade to achieve 100%+ NRR. The mix of attrition (−£2.16m) versus expansion (+£1.66m) is the key gap.</li><li>Quality of growth: Gross retention at 85% and NRR at 95% align with Page 1 and confirm a consistent picture. As CAC efficiency is strong, rebalancing efforts from acquisition toward customer success and product‑led expansion should have outsized impact on durable growth.</li></ul><p>Actions: prioritize save motions on at‑risk accounts, expand within high‑propensity cohorts, and align pricing/packaging to reduce downsell. With land performance holding, improving retention is the most accretive lever to lift NRR to 100–105% without materially increasing spend.</p>",
  "page3": "<p>P&L shows profitable growth with operating leverage. Revenue in the latest period is £19.76m, 96% recurring (£19.06m) and 4% non‑recurring (£0.70m). Gross margin remains 78% (gross profit £15.51m), reflecting a high recurring mix and stable unit costs.</p><ul><li>Operating expenses: S&M £4.20m (21% of revenue), Development £5.57m (28%), and G&A £3.28m (17%). Ratios have trended down over time (e.g., S&M from 34% to 21%), demonstrating efficiency and scale benefits.</li><li>Profitability: EBIT is £2.46m (12% margin), up from negative early in the period. The Rule of 40 reads 32%, consistent with Page 1. CAC ratio 0.62 and LTV:CAC 8.0 support continued profitable growth.</li><li>Headcount: total 121 (Development 64, S&M 26, Gross/Ops 22, G&A 9). Despite rising headcount, margin expansion indicates productivity gains; ARR per head of 174k corroborates this.</li></ul><p>Implications: We can sustain EBIT in the low‑to‑mid teens while selectively increasing CS and product investments aimed at retention and expansion. Non‑recurring work has a 27% margin versus 80% on recurring, and it is a small share of revenue; keep it focused on services that accelerate time‑to‑value and upsell rather than broad delivery that dilutes margins.</p>",
  "page4": "<p>Customer mix and concentration highlight where to double down and where to de‑risk. By vertical, Energy & Utilities is the largest contributor (£3.95m), followed by Life Science (£2.50m), Government (£1.31m), Finance & Professional Services (£0.90m), and 3rd Sector & Education (£0.77m). The top vertical contributes a significant share of total on this view, indicating concentration risk alongside a clear ICP fit. By country, South America (£2.18m) and Asia (£2.09m) lead, with North America (£1.87m), Africa (£1.86m), and Europe (£1.42m) close behind, suggesting relatively diversified geographic momentum despite vertical concentration.</p><p>The 12‑month ARR bridge shows a healthy land and expand engine (expand and land both positive) offset by churn and downsell. Net growth of 70% on this view is consistent with the multi‑page story: strong new logo wins and expansions counterbalanced by attrition. The per‑customer monthly grid highlights discrete expansion events across several accounts, indicating room to systematize cross‑sell and seat growth.</p><p>Actions: deepen focus in the strongest ICP segments (notably Energy & Utilities and Life Science) while broadening penetration in underweight verticals to reduce concentration. Regionally, maintain balanced coverage but tailor save/expand plays in segments with higher churn signals. Use the account‑level patterns in the grid to codify success paths (implementation milestones tied to expansion triggers) that can lift NRR above 100%.</p>"
}