{
  "executiveSummary": "<p>Actuals run through the last completed month (Dec 2025); figures from Jan 2026 onward are forecast. ARR closed Dec at £9.4m with 70% YoY growth and 94% of revenue recurring. Gross margin held 78% and the Rule of 40 is 63%. Profitability is close: EBIT was -7% in Dec but is forecast to turn positive by Jun 2026 and rise thereafter as S&M and G&A ratios decline.</p><p>Key watch items: retention softness (gross 79%, net 90%, logo 85%) and concentration in Energy & Utilities and Life Science. The last three actual months delivered net ARR of +£506k on 8 new logos, but with 4 logo losses (‑£405k) and downsell in Finance & Professional Services.</p>",
  "page1": "<p>Scale and efficiency are improving: ARR £9.4m, customers 96, ARR per head £147k on 64 heads. Growth 70% is well above the benchmark shown, aided by strong recurring margin (83%) and a low CAC ratio (0.56), driving LTV:CAC 6.5. Rule of 40 at 63% is solid for stage.</p><p>Pressure points: logo retention 85%, gross retention 79%, net retention 90% — all below benchmarks shown. EBIT at -7% reflects investment; S&M 37% of revenue remains elevated relative to benchmark, though development and G&A percentages are better than benchmarks. Mix remains highly recurring (94%), with minimal non‑recurring margin (4%).</p>",
  "page2": "<p>Logos grew from 68 to 96 over the last four quarters, with ARR rising from £6.8m to £9.4m. Quarterly net ARR slowed to £506k in Dec after stronger prior quarters (£1.3m, £0.9m, £1.2m), as land fell to £720k and attrition increased (‑£405k). Retention metrics in Dec: logo 96%, gross 95%, net 98% at the quarterly level, yet the 12‑month rolling on page 4 shows a weaker 90% — the gap reflects recent quarters carrying higher churn.</p><p>Forecast takes ARR to £17.6m by Dec 2027 with steady logo adds (to 168) and improving retention back to ~97–100% gross/net. Assumption check: expansion steps up from Mar 2026 onward while downsell/attrition moderate; this underpins the acceleration to c.9–10% quarterly growth from mid‑2026.</p>",
  "page3": "<p>P&L remains margin‑led: gross margin steady at 78%. Operating ratios improve across the plan: S&M from 46% (Mar 2025) to 26% (Dec 2027), G&A from 25% to 19%, Dev ~28% steady. EBIT troughed at -£1.2m early 2025 and narrows to -£0.6m by Dec 2025; forecast turns positive in Jun 2026 (£0.2m) and builds to £0.9m by Dec 2027.</p><p>Efficiency: CAC ratio trends down toward 0.53 by 2027, aligning with page 1, while LTV:CAC strengthens to ~9–10 in the plan. Headcount rises from 64 (Dec 2025) to 106 by Dec 2027, with most growth in Product/Engineering and Go‑to‑Market; ARR per head improvement on page 1 suggests productivity gains even as we scale.</p>",
  "page4": "<p>ARR by vertical (Dec 2025): Energy & Utilities £3.95m and Life Science £2.50m drive the base; Government £1.31m; Finance & Professional Services £0.90m; 3rd Sector & Education £0.77m. Growth over the last 12 months strongest in Energy (+128%) and 3rd Sector (+89%); Finance is slower (+11%) with weaker net metrics.</p><p>ARR by country: South America £2.18m, Asia £2.09m, North America £1.87m, Africa £1.86m, Europe £1.42m — diversified but LATAM and Asia now lead. The rolling NRR slid to 90% through Dec but shows a slight uptick month‑on‑month; this aligns with page 2’s softer Q4 net and with the losses detailed on page 5.</p><p>Customer view highlights concentrated expansions within Energy & Utilities and selective upgrades in Life Science; downsell events are more prevalent in Finance & Professional Services. The ARR bridge reconciles to the £9.4m total and supports the Q4 slowdown driver: higher attrition and lower land.</p>",
  "page5": "<p>Last three actual months (Oct–Dec 2025) netted +£506k ARR on 17 transactions: New +£720k across 8 logos; Expand +£236k across 4; Downsells -£45k; Lost -£405k across 4 logos.</p><ul><li>By vertical: Energy & Utilities +£461k and Life Science +£180k offset Finance & Professional Services -£360k. Government +£135k; 3rd Sector +£90k.</li><li>By country: North America +£315k and South America +£135k led; Asia +£90k; Africa -£34k net after losses.</li><li>Logo dynamics: 8 lands vs 4 losses; the losses were distributed across regions (four ~£90–£135k contracts), consistent with the rolling NRR dip on page 4 and the Q4 net on page 2.</li></ul><p>Takeaway: growth continued but mix quality weakened in Finance & Professional Services and Africa. Focus for Q1: targeted save/expansion plays in at‑risk Finance accounts, reinforce Energy & Utilities momentum, and sustain North America/South America pipeline conversion to support the forecast inflection in 1H 2026.</p>"
}