{
  "page1": "<ul><li>ARR at £9.8m with 42% growth, comfortably above the 19% benchmark. This growth rate aligns with the rising new logo momentum shown on page 2 and improving EBIT on page 3.</li><li>Customer count at 161 and average ARR per customer at £61k are consistent with page 2’s ending ARR/logos math, indicating mix stability despite higher new-logo contribution.</li><li>Gross margin holds at 78% (vs 72% benchmark). Recurring margin at 80% and recurring revenue mix at 96% demonstrate a resilient core; non‑recurring margin at 28% is healthy but non‑core.</li><li>Retention picture is mixed: logo retention at 91% (on benchmark) but gross retention at 87% (below 91% benchmark) signals elevated downsell and churn pressure. This aligns with rising downsell/attrition noted on page 2 and the downward NRR trend on page 4.</li><li>Net retention at 101% is just on benchmark, reflecting that expansion is offsetting gross churn, but only modestly. Sustaining growth will require either higher expansion or improved gross retention.</li><li>Go‑to‑market efficiency is strong: CAC ratio at 0.59 (better than 1.20 benchmark) and LTV:CAC at 10.1. Rule of 40 at 46% materially exceeds the 15% benchmark, supported by ~42% growth and improving profitability on page 3.</li><li>Operating discipline: S&M at 27% of revenue, Development at 28%, and G&A at 19% are all trending better than benchmark values shown. This ties to EBIT margin at 4% versus a negative benchmark; page 3 shows this improving to double digits over the forward periods.</li><li>Headcount at 60 with ARR per head at 163 (vs 77 benchmark) indicates strong productivity; headcount ramp on page 3 concentrates in Development and Gross/Support, which should be monitored to preserve this productivity.</li><li>Key watchouts: soft gross retention (87%) and plateauing NRR risk limiting compounding growth; cross‑reference page 4 where NRR trends down to 88% on a rolling basis and page 2 where attrition volumes rise.</li></ul>",
  "page2": "<ul><li>Logo engine scaling: by Dec 28, 61 new logos vs 20 lost, taking total logos to 202 (from 95 at the start). This underpins ARR scale and supports the healthy CAC ratio on page 1 and the S&M efficiency on page 3.</li><li>ARR build: Dec 28 expansion £1,144k, downsell -£644k, attrition -£1,163k, yielding ARR retained £9,088k and ARR net +£2,388k. Expansion remains robust, but rising downsell and attrition are diluting net retention.</li><li>Growth rate moderates: Growth % eases from low‑40s to mid‑20s by late 28. Mix is shifting toward new‑logo “land” (Dec 28 land £3,050k) while retention metrics drift down, consistent with page 4’s NRR decline.</li><li>Retention metrics: logo retention ~88–91% and gross retention in the low‑80s/high‑80s trend down over time, matching page 1’s 87% gross retention and page 4’s NRR at 88% by year‑end in that view.</li><li>Average ARR per logo remains ~£60–61k (ARR £12.1m / 202 logos), consistent with page 1 average ARR metric, indicating relatively steady price/mix despite heavier new‑logo contribution.</li><li>Deals scale up to ~4,622 by Dec 28, supporting the CAC ratio improvement (page 1) and S&M leverage (page 3). Ensure deal quality remains high to protect gross/net retention.</li><li>Actions: double‑down on expansion programs for cohorts with strong product fit; targeted save plays for higher‑risk segments flagged on page 4; continue efficient new‑logo acquisition given current CAC/LTV, but gate with retention leading indicators.</li></ul>",
  "page3": "<ul><li>Revenue mix is healthy: recurring rises to ~£10.9m by Dec 28; non‑recurring ~£0.4m. Gross margin remains stable at 78%, aligning with page 1 and supporting the Rule of 40.</li><li>Operating leverage improving: S&M ratio declines from ~31% to ~23%; Development holds ~28–29%; G&A eases from ~19% to ~15%. This drives EBIT from negative to ~12% by Dec 28, echoing page 1’s positive EBIT metric and boosting Rule of 40 to mid‑30s.</li><li>Efficiency metrics: CAC ratio improves to ~0.56 by Dec 28, but LTV:CAC trends down from double‑digits to ~7.1, reflecting weakening retention/NRR seen on pages 1, 2, and 4. The acquisition engine is efficient, but lifetime value pressure is emerging.</li><li>Headcount scales from 37 to 70, concentrated in Development (17 to 37), S&M steady mid‑teens, and Gross/Support growing to 13. Despite growth, ARR per head remains strong (page 1), indicating productivity is being maintained.</li><li>Profitability trajectory: steady gross margin plus opex ratio improvements deliver expanding EBIT. To sustain this, prioritize retention investments with clear ROI; otherwise, lower LTV will cap further margin expansion.</li><li>Actions: maintain S&M efficiency discipline; invest in customer success and product quality to stabilize gross retention; instrument cohort‑level NRR goals tied to compensation; re‑assess hiring ramp in Development against retention‑driven roadmap outcomes.</li></ul>",
  "page4": "<ul><li>ARR concentration by vertical: Energy & Utilities ~£1.99m (largest), Government ~£1.19m, 3rd Sector & Education ~£0.94m, Finance & Professional ~£0.75m, Life Science ~£0.41m. Growth is strongest in Finance & Professional (~71%) and Energy (~49%); Life Science is slightly negative. This mix informs where to focus expansion and save motions.</li><li>ARR by country: Asia ~£1.99m, Africa ~£1.11m, Europe ~£1.08m, North America ~£1.03m, South America small. Europe and North America show higher growth (≈72% and ≈66%), while South America contracts. Allocate GTM to high‑growth, high‑retention regions; ring‑fence investment in shrinking pockets.</li><li>ARR bridge and NRR: net growth of ~42% is propelled by new land (~£2.0m) and expansion (~£0.5m) but offset by lost (~£0.73m) and downsell (~£0.23m). Rolling 12‑month NRR steps down from ~106% to ~88%, consistent with pages 1 and 2 and the LTV:CAC drift on page 3.</li><li>Customer‑level heatmap indicates expansion is distributed but punctuated by specific accounts with step‑ups; there are also isolated reductions. This suggests targeted account plans could recover several points of NRR without broad pricing moves.</li><li>Implications across pages: the strong new‑logo engine (page 2) and high gross margin (pages 1 and 3) provide headroom to invest in retention. Stabilizing NRR back toward 100–105% would lift LTV, protect Rule of 40, and sustain EBIT expansion.</li><li>Actions: focus CS and product roadmap on segments with negative or flat NRR (e.g., Life Science, South America); replicate the playbooks from Finance & Professional and Europe where growth and, likely, fit are strongest; introduce early‑warning churn signals and save offers for cohorts showing rising downsell on page 2.</li></ul>"
}