{
  "executive_summary": "<p>The pack combines actuals through the last completed whole month and a forecast thereafter. Based on the time series in the ARR roll and P&amp;L (pages 2–4), actuals run through Dec-25; Mar-26 onward is forecast. Please note that the KPI tile (page 1) shows a current ARR of £21.1m, while the detailed ARR schedules show £9.4m at Dec-25 actual and a glidepath to £17.6m by Dec-27. This indicates the KPI tile is presenting a later point in time and/or a different scope. I will align definitions for the next pack so page 1 and pages 2–4 reconcile precisely.</p><p>At Dec-25 actuals, we ended the year with £9.4m ARR, gross margin of 78% and recurring margin of 80%. Efficiency continues to strengthen: CAC ratio ~0.62 and LTV:CAC ~8x are healthy, and Rule of 40 reads 32%. Retention is the main unlock: logo retention at 87% and gross retention at 85% keep NRR at 95%—below our 100%+ target—despite solid expansion. The last three months (page 5) delivered £506k net new ARR, driven by Energy &amp; Utilities and North America/South America, offset by losses concentrated in Finance &amp; Professional Services and Africa.</p>",
  "page_1": "<p>Scale and growth: The KPI panel shows ARR at £21.1m with 20% growth versus a 19% benchmark, 195 customers and £108k average ARR per customer. ARR per head is 174, supported by headcount at 121. Trend lines indicate steady expansion.</p><p>Revenue quality: Gross margin at 78% and recurring margin at 80% are stable and above benchmark. 96% of revenue is recurring, and non‑recurring margin is 27%—useful for services leverage without diluting gross margin profile.</p><p>Profitability and spend mix: EBIT margin shows 12% versus a negative benchmark, while operating mix is balanced: Sales &amp; Marketing 21%, Development 28%, General 17%. The trajectory implies operating leverage as we scale (see page 3 forecast where EBIT turns and expands).</p><p>Efficiency: Rule of 40 at 32% versus 15% benchmark reflects the combination of growth and profitability. CAC ratio at 0.62 and LTV:CAC at ~8x remain attractive and consistent with page 3 KPIs. Retention is the drag: logo retention 87% (vs 91% benchmark), gross retention 85% (vs 91%) and NRR 95% (vs 101%). Page 5 details where churn is concentrated in the last quarter.</p><p>Note on scope/timing: The KPIs are presented as current values with trend indicators. The detailed ARR roll (pages 2 and 4) shows Dec‑25 actual ARR of £9.4m and a forecast to £17.6m by Dec‑27, so the page 1 ARR likely reflects a later period or broader scope. We will harmonize these definitions in the next pack.</p>",
  "page_2": "<p>Logos and pipeline dynamics: New logos remain strong through the plan horizon (e.g., 49–60 per quarter in 2026–27), while lost logos trend between 10–13 per quarter in the forecast. The logo base increases from 68 (Mar‑25) to 168 (Dec‑27). This sustained land motion is the key counterweight to churn.</p><p>ARR bridge: From Mar‑25 to Dec‑27, ARR builds from £6.8m to £17.6m. The Dec‑25 actual ARR is £9.4m. Expansion is consistent (e.g., £619k in Dec‑25 actual quarter and £1.2m+ per quarter in 2026–27), but attrition remains meaningful (e.g., -£878k in Dec‑25 actual, -£1.1m to -£1.3m per quarter forecast). Downsells are present but smaller than attrition.</p><p>Retention metrics: At Dec‑25 actual, logo retention is 85%–90% depending on quarter, gross retention 79%–85%, and net retention around 90%–98% across the series. The forecast improves net retention to 97%–98% but still below best‑in‑class, leaving room for a targeted retention program (see page 5 for last‑quarter loss concentration).</p><p>Growth profile: Quarterly growth rates compress into early 2026 (51% in Mar‑26 to 32% in Sep‑26) and then stabilize/improve into 2027 (37%–42%), indicating continued scale with improving efficiency (consistent with page 3’s margin/EBIT ramp).</p><p>Deals: Deal volumes track ARR growth and show a healthy funnel conversion into 2027. The path to plan depends on keeping expansion momentum while reducing attrition by a few points.</p>",
  "page_3": "<p>P&amp;L shape: Revenue rises from £5.4m (Mar‑25) to £8.4m (Sep‑25), £8.4m–£9.3m (Dec‑25 actual to Mar‑26), and then to £15.8m by Dec‑27. Gross margin holds at 78% throughout, demonstrating scalable delivery.</p><p>Operating leverage: Sales &amp; Marketing falls from 46% of revenue (Mar‑25) to 26% (Dec‑27) as the model gains efficiency. Development holds near 28% and General trends to ~19% by late 2027. Operating costs grow in absolute terms but decline as a percentage of revenue.</p><p>Profitability inflection: EBIT improves from -23% (Mar‑25) to -7% (Dec‑25), turns positive in 2026 and reaches 6% by Dec‑27. Rule of 40 improves from the 60s in 2025 to high‑30s/40s in the forecast, consistent with the growth/profit trade‑off.</p><p>Go‑to‑market efficiency: CAC ratio stabilizes around 0.53–0.65, and LTV:CAC improves from 6.0–7.5 in 2026 to 9.7 by Dec‑27 (aligned with the KPI panel’s 8.0 current). This underscores attractive unit economics even while retention is being addressed.</p><p>Headcount: Total HC grows from 53 (Mar‑25) to 64 (Dec‑25 actual) and to 106 by Dec‑27. The largest increases are in Development (29 to 53) and Gross/COGS (9 to 18) to support scale, with S&amp;M moving from 21 to 26 as we normalize spend ratios.</p><p>Key takeaway: The model demonstrates durable gross margins and improving EBIT as we scale. To accelerate margin expansion, the most accretive lever is improving retention (reduces re‑acquisition costs and protects gross margin dollars).</p>",
  "page_4": "<p>ARR 12‑month roll (actuals through Dec‑25): Starting ARR £5.5m, expansion £619k, downsell -£270k, lost -£878k, yielding retained £5.0m and net ARR £3.9m with growth of ~70% YoY. The rolling NRR metric trends down over the year to ~90% and stabilizes late in the period.</p><p>By vertical at Dec‑25: Energy &amp; Utilities £3.95m and Life Science £2.50m are the growth engines. Government £1.31m, Finance &amp; Professional Services £0.90m, and 3rd Sector &amp; Education £0.77m round out the base. Gross retention is highest in Life Science (106% net noted in the bridge table due to sizable expansion) and lowest in Finance &amp; Professional Services (net 96% with larger losses). Focus retention and CS programs on Finance &amp; Professional Services where losses are recurring (see page 5).</p><p>By country at Dec‑25: South America £2.18m and Asia £2.09m lead, followed by North America £1.87m, Africa £1.86m, and Europe £1.42m. Net retention is strongest in Asia and North America; Africa shows higher loss events that require targeted save motions and executive coverage.</p><p>Customer‑level signals: The monthly grid highlights concentrated upsell in a handful of Energy &amp; Utilities and Life Science accounts and isolated red cells for churn/downsells in late 2025. The largest single‑customer value observed in the period reaches £304k ARR, indicating some concentration risk; ensure QBR cadence, multi‑threaded relationships and adoption programs in top 10 accounts.</p><p>Action: Combine vertical playbooks (E&amp;U, Life Science) with a retention sprint in Finance &amp; Professional Services and Africa. Improving NRR from ~90–95% to 100–105% would materially lift the 2027 EBIT trajectory shown on page 3.</p>",
  "page_5": "<p>Last three months actuals (Q4‑25) overview: Net new ARR of £506k from 8 new logos (£720k land), £236k expansion, -£45k downsell and -£405k lost ARR. Net logo movement is positive, with new wins outpacing losses. This reconciles to the customer list on the right panel.</p><p>By vertical: Energy &amp; Utilities +£461k and Life Science +£180k lead growth; Government adds £135k. Finance &amp; Professional Services is -£360k net in the period, offsetting a portion of the gains and consistent with the weaker retention pattern on page 4.</p><p>By country: North America +£315k and South America +£135k drive the quarter; Asia is +£90k. Africa is -£34k net, reflecting both losses and downsells. This aligns with page 4’s note that Africa requires focused save actions.</p><p>Customer concentration: The largest single loss is -£135k (Finance &amp; Professional Services), with several -£90k events. The largest single expansion is +£101k within Energy &amp; Utilities; multiple +£90k new lands contribute to the strong quarter. Concentration in a few large transactions increases volatility; continue diversification across mid‑market segments within our high‑performing verticals.</p><p>Immediate actions: 1) Launch targeted save plays in Finance &amp; Professional Services and Africa, with executive coverage on the named lost/at‑risk accounts shown. 2) Double down on Energy &amp; Utilities and North America where win rates and expansion velocity are strongest. 3) Feed page 5 insights into product success plans to address drivers behind the -£405k of losses (onboarding gaps, feature gaps, or price‑value alignment).</p><p>Implication for 2026 plan: If we lift gross retention a few points and maintain this land/expand pace, the forecasted NRR improvement on page 2 is achievable, and EBIT ramp on page 3 is likely to outperform.</p>"
}