{
  "executive_summary": "<p>Actuals are presented through December 2025, the last completed calendar month at the time of reporting. Periods from January 2026 onward are forecast. Across the year, ARR scaled to £9.4m with healthy top-line momentum and improving unit efficiency. However, retention metrics softened versus benchmark, and EBIT remained slightly negative in the year-end actuals before improving in the forecast. The last three actual months (Oct–Dec 2025) delivered £506k net new ARR, driven by strong new logo lands and targeted expansions, partially offset by a single large churn in 3rd Sector & Education and isolated downsells in Finance & Professional Services. The forecast assumes continued new logo velocity, gradual improvement in retention, disciplined S&M intensity, and operating leverage that turns EBIT positive from H1 2026.</p>",
  "page1": "<p>Scale and momentum: ARR stands at £9.4m, supported by a consistent upward trend in the sparkline. Customer count is 96 with ARR per head at 147, indicating improved productivity versus the benchmark of 77.</p><p>Growth and mix: ARR growth of 70% materially exceeds the 19% benchmark. Recurring revenue quality is strong with recurring margin at 83% and 94% of total revenue coming from recurring sources.</p><p>Profitability: Gross margin is 78% (above 72% benchmark). EBIT is -7% versus a -6% benchmark, reflecting continued investment ahead of scale. Rule of 40 is 63%, comfortably above the 15% benchmark, supported by high growth.</p><p>Go-to-market efficiency: CAC ratio is 0.56 versus a 1.20 benchmark, and LTV/CAC is 6.5, both supportive of efficient growth. S&M expense is 37% of revenue, higher than the 32% benchmark, which is consistent with the current growth phase but an area to optimize as we scale.</p><p>Retention: Logo retention at 85%, gross retention at 79%, and net retention at 90% are all below benchmarks (91%, 91%, and 101%, respectively). This aligns with the rolling 12-month NRR of ~90% seen on page 4 and the churn/loss detail on page 5; improving retention is the priority lever to compound growth without over-reliance on new lands.</p><p>R&D and G&amp;A: Development spend at 28% compares favorably to a 33% benchmark, while General is 20% vs a 22% benchmark, indicating disciplined overheads.</p><p>Headcount: 64 total with steady build, and ARR per head trending up, evidencing operating leverage.</p>",
  "page2": "<p>Logos and ARR flow: Ending ARR grew from £6.84m (Mar 2025) to £9.42m (Dec 2025). Quarterly growth moderated through the year (24%, 13%, 16%, then 6% in the Dec quarter), consistent with seasonality and the Q4 churn highlighted on page 5.</p><p>Retention: Dec-25 quarter shows logo retention at 96%; gross retention at 95% and net at 98%. While quarterly retention is solid, the rolling 12-month NRR (page 4) sits around 90%, reflecting earlier-period churn and downsell. Protecting the base and managing contraction is a key 2026 focus.</p><p>Land and expand: New ARR from lands was £720k in the Dec quarter (see page 5 detail), and expansion was £236k. Deals trended down into Dec-25 (1,639 → 1,265 → 1,603 → 1,055), indicating fewer but higher-value wins and a focus on quality.</p><p>Forecast outlook: The model projects ARR moving from £9.42m (Dec 2025 actual) to £11.06m by Sep 2026 and £17.65m by Dec 2027, with logo count progressing from 96 actuals to 168 by end-2027. Retention assumptions improve modestly (gross 95–100%, net ~98–101%) and are achievable if we execute on the churn themes observed in Q4.</p>",
  "page3": "<p>Revenue and margin (actual): For Dec 2025, revenue is £8.38m YTD-equivalent with gross margin at 78% (£6.58m gross profit). Mix remains strongly recurring (94%), aligning with the quality signals on page 1.</p><p>Operating investments: S&amp;M at 37% of revenue supported strong ARR growth but remains above benchmark; Development at 28% and General at 20% reflect disciplined product and overhead spending. Operating costs were £7.17m in Dec 2025, resulting in EBIT of -£0.60m (-7%).</p><p>Efficiency: CAC ratio at 0.56 and LTV:CAC at 6.5 indicate attractive customer economics and headroom to scale. The Rule of 40 at 63% validates the growth-efficiency balance despite negative EBIT.</p><p>Headcount: Total headcount reached 64 by Dec 2025 (S&amp;M 21, Development 29, Gross/COGS 11, G&amp;A 4). The forecast builds to 106 by Dec 2027 with a controlled slope, enabling operating leverage.</p><p>Forecast trajectory: Revenue growth outpaces opex from early 2026; EBIT turns positive by Jun 2026 and expands to £0.89m (6%) by Dec 2027, driven by lower S&amp;M intensity (27% → 26%) and stable gross margins around 78%.</p>",
  "page4": "<p>ARR composition (Dec 2025 actual): Total ARR £9.42m. By vertical: Energy &amp; Utilities £3.95m, Life Science £2.50m, Government £1.31m, Finance &amp; Professional Services £0.90m, 3rd Sector &amp; Education £0.77m. By country: South America £2.18m, Asia £2.09m, North America £1.87m, Africa £1.86m, Europe £1.42m. Concentration is highest in Energy &amp; Utilities and in the Americas/Asia.</p><p>Retention and growth signals: Rolling 12-month NRR trended down through 2025 to ~90% in Oct–Dec before stabilizing. Vertical-level gross and net retention are strongest in Life Science and Energy &amp; Utilities, while 3rd Sector &amp; Education and Finance &amp; Professional Services show weaker retention, consistent with the Q4 churn and downsell on page 5.</p><p>ARR bridge: Dec 2025 shows retained ARR of ~£5.01m, with expansion of £619k, downsell of -£270k, and lost of -£878k across the year, yielding ARR net add of £3.88m and lands of £4.41m. The bridge highlights that new lands remain the primary growth driver; improving retention would compound growth further.</p><p>Customer-level dynamics: The heatmap shows multiple mid-sized expansions during 2025 and one larger uplift in November. The distribution of expansions across Energy &amp; Utilities and Life Science aligns with the expansion totals on page 5.</p>",
  "page5": "<p>Last three months actuals (Oct–Dec 2025): Net new ARR was £506k, composed of £720k new, £236k expand, -£45k downsell, and -£405k lost. This reconciles to the softer Q4 growth rate seen on page 2 and the NRR dip on page 4.</p><p>By vertical: New ARR was broadly distributed—Energy &amp; Utilities £180k, Life Science £180k, Government £90k, Finance &amp; Professional Services £180k, 3rd Sector &amp; Education £90k. Expansion concentrated in Energy &amp; Utilities (£146k) with smaller contributions from Life Science and Government (£45k each). A single -£405k churn in 3rd Sector &amp; Education drove most of the loss and is the principal drag on Q4 retention.</p><p>By country: New ARR skewed to North America (£360k) and South America (£180k), with £90k each in Africa and Asia. Losses were concentrated in Africa (-£225k) and split between North America and South America (-£90k each). Net by country: North America +£315k, South America +£135k, Asia +£90k, Africa -£34k.</p><p>Customer concentration: The quarter featured multiple £90–£101k lands and expansions across Energy &amp; Utilities and Life Science. The single large churn event created an outsize impact versus a diversified set of smaller wins; mitigating this single-logo concentration risk in the weaker verticals is a clear 2026 action.</p><p>Actions underway: sharpen renewal playbooks in 3rd Sector &amp; Education and Finance &amp; Professional Services; prioritize multi-threading and success plans for top 10 at-risk accounts; continue leaning into Energy &amp; Utilities and Life Science where expansion momentum is strongest; maintain CAC discipline while improving S&amp;M conversion to sustain positive net adds without elevating spend ratio.</p>"
}