{
  "executiveSummary": "<p>Results reflect actuals through December 2025; figures beyond that point are forecast. ARR closed the actual period at £9.4m with 70% YoY growth, 78% gross margin, and Rule of 40 at 63. Net retention is 90% with logo retention at 85%, highlighting churn pressure concentrated in Finance & Professional Services and selected African accounts. Q4 actual ARR added £506k net on 17 new/expand logos and 4 net logos, led by Energy & Utilities and North America; a single large loss in Finance & Professional Services offset gains. Full-year EBITDA slightly beat budget (−£595k vs −£625k) on disciplined S&M and R&D spend, partially offset by higher G&A. The FY26–FY27 forecast shows operating break-even in H1 FY26 and EBIT expanding to £891k by Dec 2027 as S&M mix normalizes and CAC efficiency holds. Near-term focus: protect gross retention back above 90%, prosecute expansion in Energy & Utilities and Life Science, and remediate Finance & Professional Services churn drivers.</p>",
  "page1": "<p>Momentum remains strong at scale: ARR £9.4m; customers 96; ARR per head 147 vs 77 benchmark. Growth (70%) outpaces CAC ratio (0.56) and supports LTV:CAC of 6.5. Quality of revenue is high (recurring 94% of revenue; recurring margin 83%). Profitability is improving but not yet through P&L break-even: EBIT −7% vs −6% benchmark, with 78% gross margin. Efficiency signals are mixed: Rule of 40 at 63% is healthy, but retention metrics lag benchmarks—logo 85%, gross 79%, net 90%—indicating churn and downsell pockets to address. S&M at 37% of revenue is trending down; R&D at 28% and G&A at 20% are within scale-up norms.</p>",
  "page2": "<p>Logos and ARR scaled steadily through the year: 68 to 96 logos across FY25 with ARR rising from £6.8m to £9.4m. Across the actual quarters: growth rates were 24% (Mar), 13% (Jun), 16% (Sep), 6% (Dec) as land slowed in Q4 and churn ticked up. Q4 showed ARR retained £8.7m, land £720k, and ARR net £506k. Retention rates remain structurally below target: gross 95–97% in early quarters but 95% in Dec, with logo retention dipping to 96% in Sep and 96% in Dec; net retention 98–101% mid-year, easing to 98% in Dec. The forecast lifts logos to 168 and ARR to £17.6m by Dec 2027, with improving gross/net retention (97–100%) as mix shifts to higher-stability segments.</p>",
  "page3": "<p>Revenue closed at £8.38m for FY25 actuals with 78% gross margin sustained throughout. Operating cost discipline improved operating leverage: S&M reduced from 46% of revenue in Mar to 31% by Dec; R&D held ~28–29%; G&A ~20%. EBIT improved from −23% in Mar to −7% by Dec and is forecast positive from Jun 2026 onward, reaching 6% by Dec 2027 as revenue scales to £15.8m and gross margin stays ~78%. CAC ratio trends from ~0.65 to 0.53 by 2027, and LTV:CAC expands from 6.5 to ~9.7. Headcount grew from 53 to 64 over FY25 and is planned to 106 by 2027 with the majority in Product/Engineering to support expansion without re-inflating S&M intensity.</p>",
  "page4": "<p>ARR concentration and retention drivers are clear. By vertical at Dec 2025: Energy & Utilities £3.95m and Life Science £2.50m lead growth with strong net retention (128% and 106% respectively) and solid gross retention (95% and 93%). Government is steady at £1.31m (net 96%). Finance & Professional Services is small (£0.90m) but volatile with weak gross retention (39%) and net 44%, the principal source of churn. By region: South America £2.18m and Asia £2.09m are top contributors; North America £1.87m and Africa £1.86m; Europe £1.42m. Current rolling NRR is 90% after earlier highs, indicating stabilization but below target; gross retention 89% overall in the year and needs to normalize above 92%. Land contribution for FY25 actuals was £4.41m, yielding ARR net of £3.88m and 70% ARR growth.</p>",
  "page5": "<p>Last three months actuals (Oct–Dec 2025) added £506k net ARR and 4 net logos: New £720k (8 logos), Expansions £236k (4), Downsell −£45k (1), Lost −£405k (4). Mix: Energy & Utilities led with £461k and 4 logos; Life Science £180k; Government £135k; 3rd Sector £90k; Finance & Professional Services −£360k due to a single large loss. Regional skew: North America £315k and South America £135k were strong; Asia £90k; Africa −£34k from churn. Key customer movements show concentration of wins in E&U across multiple regions, while the Finance & Professional Services loss offset multiple smaller lands. Action: targeted save/expansion playbooks for Finance & Professional Services and African accounts; double down on E&U and Life Science where win rates and expansion velocity are highest.</p>",
  "page6": "<p>Against budget for FY25, revenue was +£122k (+1%), gross profit −£80k (−1%) on higher delivery cost, but overheads outperformed: S&M +£405k favorable (spend lower), Development +£79k favorable, partially offset by higher G&A (−£468k unfavorable). EBITDA beat by £30k (−£595k vs −£625k). Q4 and the latest month both delivered small EBITDA beats. ARR outperformed budget by £382k (+11%) driven by higher additions (+£329k) and lower-than-budget attrition (+£115k), with upsell slightly under (+£41k). Outlook: maintain S&M efficiency while reallocating to segments with superior retention; address G&A overruns; raise gross retention back above 92% to lift NRR and sustain the forecasted break-even path in FY26.</p>"
}