{
  "executiveSummary": "<p>Results in this pack are actuals through the last completed whole month (December 2025). All periods beyond December 2025 are forecast. The prior three months of actual in-period ARR movements (October–December 2025) are summarized on page 5 and reconcile to the ARR bridge on page 4 and to the closing ARR of £9.4m on page 1.</p><p>Top line continues to expand with ARR at £9.4m, up 70% year over year, with strong new logo activity and expansions offsetting elevated churn in the quarter. Unit economics are attractive: gross margin is 78%, CAC ratio is 0.56, LTV:CAC is 6.5, and the Rule of 40 is 63%. Profitability is improving but still negative at the EBIT line in the actuals; the forecast shows a turn to positive EBIT during 2026 driven by operating leverage in Sales & Marketing and G&A while maintaining product investment.</p><p>Key takeaways for the quarter just ended: net new ARR of approximately £0.5m in the last three months (page 5) came from broad-based new logo wins, especially in North America, partially offset by a single larger logo loss in Energy & Utilities and a downsell in Finance & Professional Services. Net retention on a rolling 12‑month basis is 90% (page 4), highlighting the need to continue near-term focus on retention and customer success while sustaining efficient growth.</p>",
  "page1": "<p>Overall metrics show healthy growth with improving efficiency, alongside retention that remains below benchmark and continues to be the primary drag on compounding.</p><ul><li>Scale: ARR £9.4m with 96 customers and an average ARR per customer of £98k. ARR per head is 147, materially above the benchmark of 77, indicating good productivity at current headcount of 64.</li><li>Growth and retention: ARR growth 70% versus a 19% benchmark. Gross retention 79% and net retention 90% are below benchmarks (91% and 101%), consistent with the 12‑month NRR view on page 4. This aligns with the last three months’ churn and downsell detail on page 5.</li><li>Margins and mix: Gross margin 78% and recurring margin 83% are both above benchmark, with recurring revenue 94% of total. Non‑recurring margin is small at 4%, which helps sustain blended gross margins.</li><li>Operating profile: S&M at 37% of revenue is above the 32% benchmark, but CAC ratio at 0.56 and LTV:CAC of 6.5 indicate efficient acquisition despite elevated S&M mix. Development is 28% (below 33% benchmark) and G&A 20% (below 22%). EBIT margin is -7% versus a -6% benchmark, improving in the forecast (page 3).</li><li>Efficiency: Rule of 40 at 63% comfortably exceeds the 15% benchmark, supported by high growth and solid margins.</li></ul><p>Actions: address gross and net retention through targeted CS motions (see churn concentration by vertical and country on page 4 and logo-level movements on page 5) while preserving acquisition efficiency.</p>",
  "page2": "<p>Logos, ARR and deals demonstrate steady compounding with disciplined acquisition and expanding logo base.</p><ul><li>Logo base: logos rise from 68 (Mar 25) to 96 (Dec 25 actual) and are forecast to 168 by Dec 27. Logo retention is mostly mid‑ to high‑90s, with a dip around late 2025 consistent with the last three months of actual churn on page 5.</li><li>ARR dynamics: ARR grows from £6.84m (Mar 25) to £9.42m (Dec 25 actual), with forecast progression to £17.65m by Dec 27. Growth percentages step down from 24% to mid‑single digits in some quarters, then re‑accelerate as lands and expansions increase in 2026–2027.</li><li>Movement drivers: retained ARR increases each period; expansions run consistently positive, while attrition varies with noticeable larger negatives in late 2025. Landed ARR contributes meaningfully each quarter and tracks with deal count.</li><li>Deals: deal volume grows into 2026–2027, supporting the forecasted ARR expansion. This is consistent with the improving CAC and LTV:CAC on pages 1 and 3.</li></ul><p>Focus: maintain new logo pace while compressing attrition spikes seen in late 2025 to stabilize gross and net retention.</p>",
  "page3": "<p>Profit and loss shows steady revenue growth, resilient gross margins, and operating leverage building into 2026.</p><ul><li>Revenue and gross margin: revenue increases from £5.41m (Mar 25) to £8.38m (Dec 25 actual), with gross margin stable at 78% across periods. Recurring revenue is the dominant component, aligning with page 1’s 94% recurring mix.</li><li>Operating expenses: S&M decreases as a percentage of revenue from mid‑40s in early 2025 to ~37% by Dec 25, with a forecast glidepath to the mid‑20s by 2027. Development remains around 28–29% to support roadmap velocity. G&A trends down as a percent of revenue, delivering leverage.</li><li>Profitability: EBIT improves from -£1.22m (Mar 25) to -£0.60m (Dec 25). The forecast turns EBIT positive in 2026 and expands to £0.89m by Dec 27, with EBIT margin improving from -7% (Dec 25) to 6% (Dec 27). This trajectory is consistent with the Rule of 40 and CAC/LTV metrics on page 1.</li><li>Go-to-market efficiency: CAC ratio remains ~0.60 in actuals and improves modestly in the forecast, while LTV:CAC rises from 6.5 to 9.7 by Dec 27, reflecting better retention assumptions and mix.</li><li>Headcount: total rises from 53 (Mar 25) to 64 (Dec 25) and is forecast to 106 by Dec 27, with most growth in Development and Gross Cost/Services functions to support customer delivery and product roadmap. ARR per head remains strong (page 1).</li></ul><p>Implication: with gross margins stable and S&M/G&A leverage, the plan depends on retention improvement (see pages 4 and 5) to realize the EBIT inflection in 2026.</p>",
  "page4": "<p>ARR composition and retention diagnostics highlight both concentration and opportunity.</p><ul><li>ARR bridge and growth: starting ARR of £5.54m, plus expansions of £0.62m and lands of £4.41m, offset by downsell of £0.27m and lost of £0.88m, yield closing ARR of £9.42m and net ARR growth of £3.88m (70%). This reconciles with the page 1 ARR and the in‑period movements seen on page 5 for the last quarter.</li><li>NRR trend: rolling 12‑month NRR steps down from 114% to 90% by December 2025 with a slight uptick at period end. This aligns with page 1 net retention (90%) and underscores why churn control is the top lever for compounding in 2026.</li><li>Vertical mix: Energy & Utilities (£3.95m) and Life Science (£2.50m) together comprise the majority of ARR. The period includes a notable logo loss in Energy & Utilities (see page 5), which is the primary driver of the late‑2025 gross retention dip.</li><li>Geographic mix: South America (£2.18m), Asia (£2.09m), North America (£1.87m), and Africa (£1.86m) are balanced, with Europe at £1.42m. New logo strength in North America in the last quarter (page 5) offsets churn elsewhere.</li><li>Customer view: the customer‑level timeline shows new lands and expansions broadly distributed, with isolated red cells for downsell/loss concentrated in late 2025. This pinpoints follow‑ups for CS playbooks and save motions.</li></ul><p>Actions: reduce concentration risk in Energy & Utilities by diversifying new lands and deepening multi‑threading within top accounts; prioritize early warning signals in accounts showing usage or value‑realization risk to lift NRR above 100%.</p>",
  "page5": "<p>Last three months of actual ARR movements (October–December 2025) net to +£506k ARR, driven by broad new logo strength and selective expansions, partially offset by one large churn event and a downsell.</p><ul><li>By motion: New +£720k (8 logos), Expand +£236k, Downsell -£45k (1 logo), Lost -£405k (4 logos), net +£506k and net +4 logos.</li><li>By vertical: New ARR was broad‑based across all five verticals; Expands were concentrated in Energy & Utilities and selected public sector; the single largest loss was in Energy & Utilities (-£405k), and a downsell occurred in Finance & Professional Services (-£45k).</li><li>By country: New ARR skewed to North America (+£360k) with additional wins across Africa, Asia and South America; the downsell was in Africa (-£45k); churn was spread but dominated by the single Energy & Utilities loss.</li><li>Top customer events: multiple £90–£101k new lands and expansions, with the large -£405k logo loss in Energy & Utilities the key headwind.</li></ul><p>Implications: the engine is landing efficiently (corroborated by CAC on pages 1 and 3). To improve NRR from 90% toward >100%, near‑term priorities are (1) targeted save/expansion programs in Energy & Utilities, (2) playbooks for Finance & Professional Services to prevent further downsell, and (3) ensure North America new logos reach time‑to‑value quickly to activate early expansions.</p>"
}