{
  "executive_summary": "<p>Overall performance is healthy with ARR at £21.1M, gross margin stable at ~78% and EBIT positive at 12% on the KPI page. Unit economics remain strong: CAC ratio ~0.62 and LTV:CAC ~8.0, supported by 96% of revenue being recurring. Growth is increasingly driven by new wins and expansion, but retention has softened: gross retention ~85% and NRR ~95% on the KPI page, and a 12‑month rolling NRR around 90% on the cohort chart. Operating discipline is visible: Sales & Marketing, Development, and General costs are declining as a percentage of revenue, moving EBIT from loss to profit across the P&L. Concentration is apparent in Energy & Utilities and Life Science verticals and in South America and Asia by region; Finance & Professional Services shows signs of pressure. For 2025 YTD, net ARR addition is £506k, with £720k of new, £236k of expansion, offset by £450k of churn/downsell, and a net decrease in logos. Near‑term focus should be stabilising retention while sustaining efficient growth.</p>",
  "page1": "<p>Key metrics indicate a balanced profile of growth and efficiency:</p><ul><li>Scale and growth: ARR £21.1M with 20% ARR growth versus a 19% benchmark. Customer count 195 with average ARR per customer at £108k. Headcount 121 and ARR per head 174 versus a 77 benchmark, indicating strong productivity.</li><li>Revenue quality: Recurring margin 80% (benchmark 77) and recurring mix at 96% (benchmark 90), providing predictability. Non‑recurring margin at 27% (benchmark 15) remains accretive but modest in mix.</li><li>Profitability: Gross margin 78% (benchmark 72). EBIT margin at 12% versus a negative benchmark, reflecting improved operating leverage seen again in the P&L.</li><li>Efficiency: CAC ratio 0.62 versus 1.20 benchmark and LTV:CAC 8.0 support efficient go‑to‑market. Rule of 40 at 32% (benchmark 15) is solid given profitability.</li><li>Retention: Logo retention 87% and gross retention 85% are below 91% benchmarks; net retention at 95% trails a 101 benchmark. This aligns with the rolling NRR near 90% on the cohort page and suggests elevated attrition/downsell pockets to address.</li></ul><p>Takeaway: profitability and efficiency are ahead of benchmarks, but retention metrics are softer than target, warranting targeted actions by segment.</p>",
  "page2": "<p>Logos, ARR and deal dynamics show strong new acquisition with moderating retention metrics over the horizon:</p><ul><li>Logos: New logos per quarter rise from 32 to 60 by Dec 27, with total logos growing from 68 to 168. Lost logos also increase (from -2 to around -13 per quarter), which tempers logo retention.</li><li>ARR build: Opening ARR grows from 3,668 to 12,454, supported by consistent expansion and growing land. Expansion ranges ~540 to ~1,592 per quarter by Dec 27; downsell and attrition remain material, especially attrition events around late 26 to 27 (e.g., -1,238 to -1,305).</li><li>Retention ratios: Logo retention trends around mid‑80s to ~90% by late 27; gross retention in the low‑to‑mid 80s; net retention around 96–98% through 27 but below 100% in several periods, echoing the KPI page.</li><li>Growth mix: Land contributions are sizable across the period (e.g., 3,690 to 5,400 by Dec 27). ARR net accelerates into 27 (to ~5,192), taking total ARR to 17,646 by Dec 27. Deal values also increase to 7,671 by Dec 27.</li></ul><p>Implication: New logo and expansion engines are robust and scaling, but increased churn and downsell episodes are dampening retention. Targeted save/expand motions in the cohorts driving attrition will lift net growth without materially increasing CAC.</p>",
  "page3": "<p>P&amp;L and headcount trends demonstrate operating leverage and improving profitability:</p><ul><li>Revenue: Total revenue increases from 5,411 to 15,823 by Dec 27, with recurring revenue as the primary driver.</li><li>Margins: Gross margin holds at ~78% throughout, consistent with the KPI page.</li><li>Operating expenses: S&amp;M declines from 46% to 26% of revenue; Development holds ~28–29%; General reduces from 25% to 19%. This mix shift delivers leverage as revenue scales.</li><li>EBIT: Moves from -1,221 (-23%) to +891 (+6%) by Dec 27. This mirrors the KPI EBIT of 12% on a trailing basis and shows sustained progress towards double‑digit operating margins.</li><li>Rule of 40: Varies through the period (mid‑60s to high‑40s by Dec 27). The glide path reflects slower retention‑driven growth offset by margin improvements.</li><li>Unit economics: CAC ratio improves/stays low around 0.53–0.65; LTV:CAC remains strong (13.6 down to 9.7 but still attractive), consistent with the KPI page values.</li><li>Headcount: Total grows from 53 to 106. Development scales from 21 to 53; S&amp;M is steady to slightly up (21 to 26); delivery/support (gross) rises from 7 to 18; G&amp;A from 4 to 9. Revenue growth outpaces headcount growth, supporting ARR per head strength on the KPI page.</li></ul><p>Focus: Continue disciplined opex scaling while prioritising retention to improve Rule of 40 without sacrificing margin gains.</p>",
  "page4": "<p>ARR by vertical and country highlights concentration and retention hotspots:</p><ul><li>Vertical mix: Energy &amp; Utilities ~£3,949k and Life Science ~£2,498k lead. Government ~£1,305k; Finance &amp; Professional Services ~£900k; 3rd Sector &amp; Education ~£765k.</li><li>Vertical retention: Gross retention by vertical ranges widely. Energy &amp; Utilities shows high gross performance (~98%); Finance &amp; Professional Services is markedly lower (around the 40% range on gross in the table), indicating a churn/downsell pocket. Net retention is strong in Energy &amp; Utilities and Life Science, weaker in Finance &amp; Professional Services.</li><li>Geography: South America (£2,183k) and Asia (£2,093k) are the largest regions, followed by North America (£1,868k), Africa (£1,856k) and Europe (£1,418k).</li><li>Regional retention: Gross and net percentages by region are generally in the 70–90% ranges with variability; the table shows pockets of lost ARR across multiple regions, with differing land strength. South America shows substantial land and healthy growth; Europe is smaller and could be a share‑gain opportunity.</li><li>ARR bridge and NRR trend: Starting ARR £5,535k, expansion £619k, downsell -£270k, lost -£878k, retained £5,006k, land £4,410k, yielding ending ARR £9,416k and ARR net £3,881k (growth ~70%). The rolling 12‑month NRR dips to ~90% by year‑end, consistent with the KPI and logos page.</li><li>Customer cohort heatmap: Growth is driven by a subset of customers with concentrated expansions and several discrete downsell/loss events. The pattern supports targeted account reviews in underperforming cohorts, notably in Finance &amp; Professional Services and selected countries.</li></ul><p>Actions: Double‑click Finance &amp; Professional Services and lower‑retention regions for root causes; replicate Energy &amp; Utilities and Life Science playbooks across similar profiles; pursue Europe as a growth catch‑up with controlled CAC.</p>",
  "page5": "<p>In‑year 2025 bridge and attribution deepen the picture:</p><ul><li>2025 net ARR: +£506k comprised of £720k new and £236k expansion offset by -£45k downsell and -£405k lost. Net logo movement is negative despite 8 new wins, indicating more logo losses than desired.</li><li>By vertical: Net ARR is strongest in Energy &amp; Utilities (+£461k) and Life Science (+£180k). Finance &amp; Professional Services shows a net decline (approximately -£360k), aligning with the lower retention seen on the vertical page.</li><li>By region: South America contributes the largest new ARR; there are net declines in Africa (around -£34k) with mixed results elsewhere. This aligns with the regional table where losses are spread and land varies by market.</li><li>Customer list: Specific downsell and lost events are identifiable, with several negative entries concentrated in Finance &amp; Professional Services and Africa. These customers should be prioritised for save/expansion plans.</li></ul><p>Near‑term priorities: convert the strong new/expand engine into higher net by arresting churn in Finance &amp; Professional Services and weaker regions; tighten early‑warning signals for at‑risk accounts; and continue to bias go‑to‑market toward segments exhibiting Energy &amp; Utilities and Life Science profiles.</p>"
}