{
  "page1": "<ul><li>ARR at £9.8m with a clear upward trend; this level is supported by strong unit economics seen across later pages (gross margin at 78% on page 3).</li><li>ARR growth at 42% materially outperforms the benchmark 19%, indicating both healthy new business and expansion (page 2 shows sustained expand activity alongside rising logo count).</li><li>Customer count at 161 with average ARR of £61k; mix is skewing to higher average deal sizes over time as shown by the consistent increase in ARR per customer on the cohort grids (pages 5–6).</li><li>Logo retention at 91% (in line with benchmark), while gross retention at 87% trails the 91% benchmark; this gap signals some downsell/seat contraction that we are already tracking in the NRR trend (page 5 shows NRR sliding through the year).</li><li>Net retention at 101% equals benchmark, supported by expansion but tempered by the noted gross retention softness.</li><li>Recurring margin at 80% and recurring revenue mix at 96% vs 90% benchmark underline a capital‑efficient subscription model; page 7 corroborates the declining proportion of non‑recurring revenue over time.</li><li>Unit economics are strong: CAC ratio at 0.59 vs 1.20 benchmark and LTV:CAC at 10.1; this aligns with lower S&M % of revenue (27%) relative to benchmark (page 3 trend shows S&M % declining).</li><li>Operating cost mix is disciplined: Development at 28% and G&A at 19% are below benchmarks, contributing to positive EBIT of 4% vs a negative benchmark and a Rule of 40 of 46% vs 15%.</li><li>Headcount at 60 and ARR per head at 163 vs 77 benchmark reflect improving productivity; the P&L (page 3) shows operating leverage as revenue scales faster than opex.</li></ul>",
  "page2": "<ul><li>Logos grow steadily from 95 to 202 by Dec 28, with 61 new and 20 lost in the latest period; the rising base supports land-and-expand momentum.</li><li>ARR mechanics by Dec 28: expand £1,144k, downsell -£644k, attrition -£1,163k, yielding ARR retained of £9,088k and net new ARR of £2,388k; this composition explains the strong growth headline on page 1.</li><li>Growth % moderates from low‑40s to 24% by Dec 28 as the base scales; watch that net retention % trends from >100% earlier to 93% in Dec 28, mirroring the NRR decline shown on page 5.</li><li>Logo retention holds in the high‑80s (88–91% range), consistent with the 91% on page 1; the gap between logo and gross retention (page 1 shows 87%) implies some seat/value contraction within retained customers.</li><li>Deals volume rises to 4,622 by Dec 28, supporting pipeline conversion; the land line (£2,388k in Dec 28) stays robust despite some moderation from the peak.</li><li>Cross‑page alignment: the gross margin in the P&L (page 3) remains 78% as ARR scales; CAC ratio improvement (page 3) is consistent with the favorable new logos-to-lost logos ratio here.</li></ul>",
  "page3": "<ul><li>Revenue scales from £5.1m to £11.3m across the period with gross margin steady at 78%; stability at scale indicates pricing and delivery discipline.</li><li>Operating leverage is visible: S&M % declines from 31% to 23%, G&A % from 19% to 15%, while Development stays around 28–29%; this mix shift underpins EBIT improvement from -2% to 12% by Dec 28.</li><li>EBIT reaches £1.35m by Dec 28; together with ~24% growth (page 2), Rule of 40 sits mid‑30s, consistent with the 46% point‑in‑time metric on page 1 when growth was higher.</li><li>CAC ratio trends down to 0.56, and LTV:CAC stabilizes around 7.1 after peaking earlier; this is consistent with the efficient acquisition signal on page 1 (CAC 0.59, LTV:CAC 10.1) while reflecting the effect of softer NRR.</li><li>Headcount expands from 37 to 70 with most growth in Development (17 to 37) and Go‑to‑Market (S&M from 11 to 16, Gross/ops from 6 to 13); ARR per head outperformance on page 1 suggests productivity gains despite headcount growth.</li><li>Risk to watch: while gross margin is stable, the deceleration in net retention visible on page 2 and page 5 could limit further operating leverage unless expansion re‑accelerates or churn/downsell are addressed.</li></ul>",
  "page4": "<ul><li>This summary view reconciles ARR/Deals with the P&L and headcount: ARR growth (page 2) feeds the revenue line (page 3), while cost discipline in S&M and G&A converts that growth into improving EBIT.</li><li>The headcount mix (bottom panel) explains opex trends: heavier investment in Development supports product roadmap and future expansion (link to expansion line on page 2), while controlled S&M % demonstrates efficient acquisition (consistent with CAC and LTV:CAC).</li><li>Action focus from the combined view: protect gross margin at 78%, push expansion to counteract downsell/attrition (page 2), and maintain S&M efficiency while evaluating whether incremental GTM capacity can lift net retention back toward 100%+.</li></ul>",
  "page5": "<ul><li>NRR rolling 12 months trends down from 106% to 88% by Dec 25; this aligns with the later‑period net % decline seen on page 2. Priority is to diagnose contraction and churn pockets by segment.</li><li>By vertical (ARR £000s): Energy & Utilities (£1,988) and Government (£1,188) are largest; Finance & Professional Services shows the fastest growth (71%) but has the lowest gross margin (66%), indicating room to optimize delivery or pricing.</li><li>Life Science has exceptional gross and net retention (97%) but is currently small (£413) and slightly negative growth (-3%); focused expansion here could be high‑quality.</li><li>By country: Asia (£1,988) is largest but with lower net % (80%); North America shows the weakest net % (68%) despite solid growth (46%), pointing to engagement or packaging issues that merit attention.</li><li>Europe combines high growth (72%) with solid net % (86%); consider doubling down where product‑market fit is strongest.</li><li>ARR per customer heatmaps (bottom and page 6) highlight where upsells are landing (green) and where downgrades occur (red). Expansions are broad‑based across mid‑sized customers, supporting the average ARR uplift noted on page 1.</li><li>Non‑recurring remains a small share of revenue (page 7 trend) and margins on non‑recurring are healthy (page 1 shows 28%), but the strategy remains appropriately subscription‑led.</li></ul>",
  "page6": "<ul><li>Customer‑level ARR cohort view shows steady month‑over‑month total growth to £5,275k by Dec 25, driven by frequent, smaller expansions across many accounts rather than a few outsized deals—this supports resilience.</li><li>Isolated downgrades appear late in the period (red cells), consistent with the NRR drift on page 5; these are actionable churn‑risk signals for Customer Success to prioritize.</li><li>The breadth of green cells across the mid‑tier suggests pricing/packaging or usage‑based levers are working; linking these patterns to segments on page 5 can refine where GTM emphasis yields the best net uplift.</li></ul>",
  "page7": "<ul><li>ARR and logos trend upward in tandem through Dec 25, evidencing both land and expand; this foreshadows the larger base and improved EBIT seen by Dec 28 in the P&L (page 3).</li><li>Non‑recurring revenue in absolute terms rises modestly toward the end, but its percentage of total declines from ~14% to ~5%, confirming the healthy recurring mix highlighted on page 1 and reflected in stable gross margins on page 3.</li><li>The improving mix and scale efficiency here are consistent with the falling S&M % and CAC ratio on page 3; sustaining logo growth while lifting NRR (pages 2 and 5) is the key to maintaining Rule of 40 performance.</li></ul>"
}