{
  "executive_summary": "<p>Overall performance remains strong with scale at approximately £9.8m ARR, healthy unit economics, and improving profitability. Gross margin is stable around 78% and operating discipline is evident with sales and marketing at roughly a quarter of revenue and general costs trending down. Retention is adequate at 87% gross and 101% net on page 1, but rolling 12‑month NRR on page 4 has drifted down to 88%, and page 2 shows modest softening in logo and gross retention into the latest periods. New logo momentum, steady expansion and disciplined CAC are offsetting churn to drive ARR growth in the 40% range. Differences between page 1 point-in-time metrics and pages 2–3 period summaries suggest timing effects; where numbers appear inconsistent, the direction of travel is still clear: growth is solid, efficiency is high, and retention is the key lever to protect the Rule of 40 and EBIT trajectory.</p>",
  "page1": "<p>Scale and growth: ARR stands at £9.8m with growth of 42% versus a 19% benchmark. Customer count is 161 and average ARR per customer is £61k, supporting a strong mix of mid-market accounts. ARR per head of 163 is more than double the benchmark of 77, indicating good productivity at a 60 headcount base.</p><p>Unit economics and profitability: Gross margin is 78% against a 72% benchmark, and recurring margin is 80% versus 77%. EBIT margin is 4% compared with a -6% benchmark, reflecting improving operating leverage as revenue scales. Non‑recurring margin is 28% (above a 15% benchmark), but non‑recurring remains a small portion of revenue given recurring revenue is 96% of total.</p><p>Go-to-market efficiency: CAC ratio is 0.59 versus a 1.20 benchmark, and LTV:CAC is 10.1, both indicating highly efficient acquisition. Sales and marketing spend is 27% of revenue, below a 32% benchmark, while development is 28% versus 33% and general is 19% versus 22%. The Rule of 40 reads 46%, supported by the combination of growth and positive margin.</p><p>Retention: Logo retention is 91% (in line with the 91% benchmark). Gross retention is 87% (below a 91% benchmark), while net retention is 101% (on the 101% benchmark). The gap between gross and net retention indicates expansion is successfully offsetting churn; however, shoring up gross retention is the most direct path to protect growth quality.</p>",
  "page2": "<p>Logos and land: New logos have increased steadily from the mid‑30s per period to the mid‑50s most recently, while lost logos have also ticked up modestly. Total logos rose from 95 to 182 across the displayed periods, demonstrating sustained acquisition.</p><p>ARR drivers: Starting ARR in each period increases consistently (for example, from 4,125 to 8,675), with expansion contributions broadly in the 600–950 range earlier and circa 900 most recently. Downsells and attrition together remain meaningful headwinds (e.g., downsell around -175 to -531 and attrition around -563 to -938 across later periods), which is why ARR retained percentages and gross/net retention percentages edge down in the most recent periods.</p><p>Retention metrics: Logo retention improves into the low 90s mid‑period but settles into the high‑80s to 90% more recently. Gross retention trends from high‑80s/low‑90s down towards the low‑80s in the latest periods. Net retention similarly moderates from above 100% to mid‑90s. This aligns with the rolling NRR decline shown on page 4 and signals an area for focused action on churn prevention and downsell control.</p><p>Growth and deals: Growth percentages per period moved from the 30–47% range down to the mid‑20s most recently, indicating a deceleration largely explained by retention softness. Land ARR has scaled from roughly 1,750 to around 2,750, and Deals values have risen to approximately 4,000, demonstrating sustained new business volume even as net retention moderates.</p><p>Implication: Acquisition volume remains healthy and is the primary driver of ARR growth while retention softness is becoming more visible. Prioritizing customer success motions to reduce attrition and downsell will improve ARR retained and stabilize growth rates.</p>",
  "page3": "<p>Revenue and margins: Revenue rises from roughly 5,146 to 10,133 with gross margin steady at 78%, indicating consistent delivery economics as we scale. Operating costs increase in absolute terms, but mix improves: sales and marketing declines from about 31% to 24–25% of revenue, development holds around 28–29%, and general falls from 19% to 16%. This operating discipline drives EBIT from negative to approximately 9% most recently.</p><p>Profitability and efficiency metrics: EBIT moves from -2% to 9%, and the Rule of 40 prints between the low‑30s and mid‑40s across periods, peaking around mid‑40s. CAC ratio remains favorable around 0.60–0.73, and LTV:CAC is strong though trending down from double digits to low‑single‑digits multiple of 7–10 in the latest periods. The decline in LTV:CAC mirrors the softening retention noted on pages 1–2.</p><p>Resource allocation and leverage: Headcount grows from 37 to 64 with most additions in development (17 to 33) and stable go‑to‑market headcount in the mid‑teens. Despite higher staffing, S&M as a percent of revenue declines, suggesting improved productivity per seller and effective demand generation. Gross function headcount increases modestly in line with revenue, helping preserve gross margin.</p><p>Implication: The P&L confirms that efficiency gains are real and compounding, but continued pressure on retention could cap the Rule of 40 and LTV:CAC improvements. Maintaining current cost discipline while addressing churn will support sustained margin expansion.</p>",
  "page4": "<p>ARR bridge and NRR trend: The 12‑month ARR bridge shows consistent expansion and new land offset by a persistent level of lost ARR, resulting in positive net growth but a declining rolling 12‑month NRR from 106% to 88%. This reconciles with the moderation in gross and net retention on page 2 and highlights churn and downsell as the primary opportunities.</p><p>Vertical mix: Energy & Utilities is the largest vertical at about £1.99m ARR, followed by Government (£1.19m), 3rd Sector and Education (£0.94m), Finance and Professional Services (£0.75m), and Life Science (£0.41m). Gross retention by vertical ranges in the mid‑60s to high‑80s, with Energy & Utilities and Government showing stronger retention than Finance and Life Science in the displayed table. Expansion and land contributions are broad‑based, but the retentive strength is concentrated in the top two verticals.</p><p>Geographic mix: Asia is the largest region at about £1.99m ARR, with Africa (£1.11m), Europe (£1.08m), and North America (£1.03m) clustered closely behind. The regional bridge indicates that some regions show strong net growth percentages (for example, Europe above 70%), while North America shows negative net growth in the period displayed due to outsized losses relative to land/expansion. This dispersion suggests targeted retention and success programs by region could yield quick wins.</p><p>Customer concentration and cadence: The per‑customer monthly matrix shows many customers anchored at recurring levels (for example, 75k units for long stretches) with periodic step‑ups to 113k. The total row steadily rises through the period to around 5,275, evidencing consistent in‑period expansion and land, albeit with isolated red cells indicating occasional downgrades or churn events that align with the NRR drift.</p><p>Implication: Growth is broad‑based across verticals and regions, but performance dispersion is meaningful. Doubling down on retention in underperforming regions/verticals while protecting the strongholds (Energy & Utilities, Government, Asia, and Europe) should stabilize NRR and lift LTV:CAC.</p>"
}