{
  "executiveSummary": "<p>Results reflect actuals through the last completed whole month (December 2025) and a forecast thereafter. The exit ARR is £9.4m with 70% growth, gross margin at 78%, and recurring mix at 94%. Efficiency remains attractive with CAC ratio 0.56 and LTV:CAC 6.5, while Rule of 40 reads 63%. Profitability is close to breakeven on an EBIT basis at -7%, with the plan moving to positive EBIT from early 2026 as operating cost ratios step down (see page 3). Retention is the primary constraint: logo retention 85%, gross retention 79%, NRR 90% on a rolling 12 months (page 4). The last three months delivered £506k net new ARR, eight new logos, and four churned logos (page 5), with strength in Energy & Utilities and North America offset by weakness in Finance & Professional Services and Africa. The forecast assumes retention improves toward 95–97% gross and 98–101% net by 2026–27 (page 2), sustained new logo cadence, and continued operating leverage. Key focus areas: stabilize retention in weaker regions/verticals, preserve S&M efficiency while scaling, and pace hiring to maintain Rule of 40 performance.</p>",
  "page1": "<p>Overall metrics show healthy growth and efficiency with a profitability inflection in sight. ARR is £9.4m, up 70% year over year. Customer count is 96 with an average ARR per customer of £98k and ARR per head of 147. Gross and recurring margins at 78% and 83% indicate solid unit economics, and recurring now represents 94% of revenue. CAC ratio of 0.56 and LTV:CAC of 6.5 validate efficient go-to-market execution. Rule of 40 at 63% is strong given the growth rate, but logo retention at 85%, gross retention at 79%, and NRR at 90% are below typical SaaS benchmarks, consistent with the 12‑month NRR trend on page 4. S&M spend ratio at 37% is trending down in the P&L (page 3) and compares well to peers, while development and G&A at 28% and 20% respectively are stable. EBIT margin is currently -7%; the P&L trajectory suggests operating leverage will flip EBIT positive in the forecast period.</p><ul><li>Strengths: growth momentum, recurring mix, CAC efficiency, Rule of 40.</li><li>Watchouts: retention metrics below benchmark, modest concentration in two verticals (page 4), and the need to sustain S&M efficiency while scaling headcount (page 3).</li></ul>",
  "page2": "<p>Logos, ARR, and deals show a disciplined land‑and‑expand motion. Logos are projected to rise from 96 at Dec 2025 to 168 by Dec 2027, with a steady cadence of 8–16 new logos per quarter. ARR builds from £6.84m (Mar 2025) to £9.42m (Dec 2025 actual) and is forecast to £17.65m by Dec 2027. Expansion remains a consistent contributor each quarter, while downsell and attrition are the drag on current NRR.</p><ul><li>Retention trajectory: Logo retention mostly 96–100% in the forecast versus 85% current; gross retention moves from 79–95% to 95–100% in the out‑quarters; net retention tightens around 98–101%. This assumes execution on the retention workstreams referenced on pages 4–5.</li><li>Growth mix: Land ARR remains meaningful each quarter (e.g., £1.08m–£1.44m in many periods), indicating room to scale without materially increasing CAC, provided S&M productivity is preserved (page 3).</li><li>Deals: Quarterly deal volume rises through 2027, supporting the ARR plan. The last three months added eight new logos (page 5), consistent with the near‑term plan.</li></ul>",
  "page3": "<p>P&L trends show steady margin quality and improving operating leverage. Revenue grows from £5.41m (Mar 2025) to £8.38m (Dec 2025) and to £15.82m by Dec 2027. Gross margin holds at 78% throughout. S&M ratio declines from 46% to 26% by 2027, development remains ~28–29%, and G&A trends from 25% toward 19%. EBIT improves from -23% (Mar 2025) to -7% (Dec 2025) and is forecast positive from early 2026, reaching +6% by Dec 2027. Rule of 40 stays above 35% through the period, benefiting from high growth as spend ratios compress.</p><ul><li>Efficiency: CAC ratio trends ~0.65 to ~0.53, aligning with page 1 metrics; LTV:CAC declines as LTV normalizes with retention assumptions but remains healthy at ~9–10 in the outer periods.</li><li>Headcount: Total rises from 53 to 64 in 2025 actuals and to 106 by 2027, with most growth in Development and Gross/Services. S&M headcount increases modestly (21 to 26) while S&M % falls, implying improving productivity that must be preserved to meet CAC targets.</li><li>Profit path: The move to positive EBIT in 2026 relies on maintaining gross margin, improving retention (to reduce replacement cost of churn), and holding S&M efficiency while scaling the land motion (pages 2 and 5).</li></ul>",
  "page4": "<p>ARR composition underscores both strength and concentration. Rolling 12‑month ARR reaches £9.42m at Dec 2025. NRR on a rolling 12 months sits at 90%, reflecting elevated downsell/churn earlier in the year, though the curve stabilizes in the last two months.</p><ul><li>By vertical: Energy & Utilities (£3.95m) and Life Science (£2.50m) represent the majority of ARR; Finance & Professional Services is smaller (£0.90m) and currently softer. Gross retention is strongest in Energy & Utilities and weaker in segments where we saw churn (see page 5 detail), highlighting where customer success resources should concentrate.</li><li>By country: South America (£2.18m), Asia (£2.09m), North America (£1.87m), and Africa (£1.86m) are broadly balanced, with Europe at £1.42m. Gross retention is weaker in North America and South America (low 70s to high 70s), which aligns with recent churn and downsell on page 5. Improving account coverage and renewal discipline in these regions is the quickest lever to lift NRR.</li><li>Land and expand: The table shows meaningful land ARR across regions and verticals, supporting continued growth with a diversified new‑logo base. Customer‑level view indicates multiple expansions across Energy & Utilities and Life Science, with isolated downsell events; targeting these expansion‑prone cohorts should raise NRR toward the mid‑90s.</li></ul>",
  "page5": "<p>Last three months actuals (Oct–Dec 2025) delivered £506k net new ARR. We signed eight new logos totaling £720k, delivered £236k of expansion, absorbed £45k in downsell, and lost four logos totaling £405k. This mix explains the 90% NRR at year‑end (page 4) and the logo retention of 85% on page 1.</p><ul><li>By vertical: Net gains were led by Energy & Utilities (+£461k) and Life Science (+£180k); Finance & Professional Services was a headwind (-£360k) due to churn and downsell. This concentration suggests we should rebalance pipeline and apply targeted save/expansion plays in Finance & Professional Services.</li><li>By country: North America contributed the most (+£315k), with Asia (+£90k) and South America (+£135k) positive; Africa was slightly negative (-£34k) driven by churn in Finance & Professional Services. This mirrors the weaker gross retention in those regions on page 4.</li><li>Customer detail: A small number of accounts drove outsized movement, including one lost customer at -£405k and several Energy & Utilities expansions/new lands of £90–£101k each. Concentration at the account level increases volatility in quarterly NRR; prioritizing early renewal engagement and multi‑threading at these larger customers is key.</li></ul><p>Actions in flight: targeted save motions in Finance & Professional Services and Africa; structured success plans for the top 20 accounts by ARR; codified playbooks to replicate Energy & Utilities expansion wins; and qualification guardrails to sustain CAC and S&M productivity as we scale (pages 1–3).</p>"
}